//Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
//Выполнить с помощью рекурсии.     N = 5 -> "5, 4, 3, 2, 1"      N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// string GetNumers(int n)
// {
//     if (n == 1)
//     {
//         return "1";
//     }

//     return n + " " + GetNumers(n-1);
// }

// Console.Write("Input a number: ");
// int n = Convert.ToInt32(Console.ReadLine());

// string result = GetNumers(n);
// Console.WriteLine(result);

//-----------------------------------------------------------------------------------------------

// Зад 66: Задайте значения M и N. Напишите прогр, к-я найдёт сумму натуральных эл-в в промежутке от M до N.
// M = 1; N = 15 -> 120;    M = 4; N = 8. -> 30

// int GetSum(int n, int m)
// {
//     if(n == m)
//     {
//         return m;
//     }

//     return n + GetSum(n-1, m);     // строго указать положение "m" и "n" в скобках, т к иначе ошибка
// }

// int result = GetSum(15, 1);        // строго указать положение "m" и "n" в скобках, т к иначе ошибка
// Console.WriteLine(result);

//-------------------------------------------------------------------------------------------------------

//Зад 68: Напишите прогр вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9    m = 3, n = 2 -> A(m,n) = 29

// int A(int m, int n)
// {
//     if (m == 0) return n + 1;
//     if (m > 0 && n == 0) return A(m - 1, 1);
//     return A(m - 1, A(m, n - 1));
// }

// Console.WriteLine(A(2,3));


