// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7

// Console.Write("Enter a first integer: ");
// int num1 = int.Parse(Console.ReadLine());

// Console.Write("Enter a second integer: ");
// int num2 = int.Parse(Console.ReadLine());

// if(num1 > num2)
// {
//     Console.WriteLine($"Max integer - {num1}");
// }

// else
// {
//     Console.WriteLine($"Max integer - {num2}");
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел
// 2, 3, 7 -> 7


// Console.Write("Enter a first integer: ");
// int a = int.Parse(Console.ReadLine());

// Console.Write("Enter a second integer: ");
// int b = int.Parse(Console.ReadLine());

// Console.Write("Enter a third integer: ");
// int c = int.Parse(Console.ReadLine());

// int max = a;

// if(a > max) max = a;
// if(b > max) max = b;
// if(c > max) max = c;

// Console.Write("max = ");
// Console.WriteLine(max);

// Задача 6: Напишите программу, к-я на вход принимает число и выдаёт, является ли число чётным(делится ли оно на два без остатка
// 4 -> да

// Console.Write("Enter a enteger: ");
// int num = int.Parse(Console.ReadLine());

// if(num % 2 == 0)
// {
//     Console.WriteLine("Yes");
// }

// else
// {
//     Console.WriteLine("No");
// }

// Задача 8: Напишите прог-у,к-я на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4

// Console.Write("Enter a integer:");
// int n = int.Parse(Console.ReadLine());

// int startnum = 2;

// while(startnum <= n)
// {
//     Console.WriteLine(startnum);
//     startnum = startnum + 2;
// }